02_OpenFOAM_FVM/cases/Ejercicio4/Parte2_ShockTube/shockTube_highOrder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    sides
    {
        type            patch;
        nFaces          2;
        startFace       999;
    }
    empty
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4000;
        startFace       1001;
    }
)

// ************************************************************************* //
