02_OpenFOAM_FVM/cases/Ejercicio4/Parte2_ShockTube/shockTube_highOrder/system/graphUniform
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Extrae datos a lo largo de una linea para postprocesado del Shock Tube

\*---------------------------------------------------------------------------*/

start           (-5 0 0);
end             (5 0 0);
nPoints         1000;

fields          (p T U rho);

axis            x;

#includeEtc "caseDicts/postProcessing/graphs/graphUniform.cfg"

// ************************************************************************* //
